
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>4.2 增量备份.md · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="4.3 压缩备份.html" />
    
    
    <link rel="prev" href="4.1 完整备份.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1.1 关于 Percona XtraBackup.html">
            
                <a href="1.1 关于 Percona XtraBackup.html">
            
                    
                    1.1 关于 Percona XtraBackup.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.2 Percona XtraBackup 如何工作.html">
            
                <a href="1.2 Percona XtraBackup 如何工作.html">
            
                    
                    1.2 Percona XtraBackup 如何工作.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.1 安装 Percona XtraBackup 8.0.html">
            
                <a href="2.1 安装 Percona XtraBackup 8.0.html">
            
                    
                    2.1 安装 Percona XtraBackup 8.0.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="2.1.1 在 Debian 和 Ubuntu 上安装 Percona XtraBackup.html">
            
                <a href="2.1.1 在 Debian 和 Ubuntu 上安装 Percona XtraBackup.html">
            
                    
                    2.1.1 在 Debian 和 Ubuntu 上安装 Percona XtraBackup.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="2.1.2 在 Red Hat Enterprise Linux 和 CentOS 上安装 Percona XtraBackup.html">
            
                <a href="2.1.2 在 Red Hat Enterprise Linux 和 CentOS 上安装 Percona XtraBackup.html">
            
                    
                    2.1.2 在 Red Hat Enterprise Linux 和 CentOS 上安装 Percona XtraBackup.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="2.1.3 从源代码编译和安装.html">
            
                <a href="2.1.3 从源代码编译和安装.html">
            
                    
                    2.1.3 从源代码编译和安装.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="2.1.4 在 Docker 容器中运行 Percona XtraBackup.html">
            
                <a href="2.1.4 在 Docker 容器中运行 Percona XtraBackup.html">
            
                    
                    2.1.4 在 Docker 容器中运行 Percona XtraBackup.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="3.1 需要的连接和权限.html">
            
                <a href="3.1 需要的连接和权限.html">
            
                    
                    3.1 需要的连接和权限.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="3.2 配置 xtrabackup.html">
            
                <a href="3.2 配置 xtrabackup.html">
            
                    
                    3.2 配置 xtrabackup.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="3.3 服务器版本与备份版本对比.html">
            
                <a href="3.3 服务器版本与备份版本对比.html">
            
                    
                    3.3 服务器版本与备份版本对比.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="4.1 完整备份.html">
            
                <a href="4.1 完整备份.html">
            
                    
                    4.1 完整备份.md
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="4.2 增量备份.html">
            
                <a href="4.2 增量备份.html">
            
                    
                    4.2 增量备份.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="4.3 压缩备份.html">
            
                <a href="4.3 压缩备份.html">
            
                    
                    4.3 压缩备份.md
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >4.2 增量备份.md</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x589E;&#x91CF;&#x5907;&#x4EFD;">&#x589E;&#x91CF;&#x5907;&#x4EFD;</h1>
<p>xtrabackup &#x652F;&#x6301;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x53EA;&#x80FD;&#x590D;&#x5236;&#x81EA;&#x4E0A;&#x6B21;&#x5907;&#x4EFD;&#x4EE5;&#x6765;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x6B21;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x5907;&#x4EFD;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F8B;&#x5982;&#x6BCF;&#x5468;&#x4E00;&#x6B21;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x548C;&#x6BCF;&#x5929;&#x4E00;&#x6B21;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#xFF0C;&#x6216;&#x8005;&#x6BCF;&#x5929;&#x4E00;&#x6B21;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x548C;&#x6BCF;&#x5C0F;&#x65F6;&#x4E00;&#x6B21;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x3002;</p>
<p>&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x6709;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A; InnoDB &#x9875;&#x9762;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x5E8F;&#x5217;&#x53F7;&#x6216; LSN&#x3002; LSN &#x662F;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x3002;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x7684; LSN &#x663E;&#x793A;&#x5B83;&#x6700;&#x8FD1;&#x66F4;&#x6539;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x590D;&#x5236; LSN &#x6BD4;&#x4E4B;&#x524D;&#x589E;&#x91CF;&#x6216;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x7684; LSN &#x65B0;&#x7684;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x7B97;&#x6CD5;&#x7528;&#x4E8E;&#x67E5;&#x627E;&#x8981;&#x590D;&#x5236;&#x7684;&#x6B64;&#x7C7B;&#x9875;&#x9762;&#x96C6;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x670D;&#x52A1;&#x5668;&#x7C7B;&#x578B;&#x548C;&#x7248;&#x672C;&#xFF0C;&#x662F;&#x901A;&#x8FC7;&#x8BFB;&#x53D6;&#x6240;&#x6709;&#x6570;&#x636E;&#x9875;&#x9762;&#x76F4;&#x63A5;&#x68C0;&#x67E5;&#x9875;&#x9762; LSN&#x3002; Percona Server for MySQL &#x63D0;&#x4F9B;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x542F;&#x7528;&#x66F4;&#x6539;&#x9875;&#x9762;&#x8DDF;&#x8E2A;&#x529F;&#x80FD;&#xFF0C;&#x8BE5;&#x529F;&#x80FD;&#x4F1A;&#x5728;&#x9875;&#x9762;&#x66F4;&#x6539;&#x65F6;&#x8FDB;&#x884C;&#x8BB0;&#x5F55;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8BE5;&#x4FE1;&#x606F;&#x5C06;&#x88AB;&#x5199;&#x5165;&#x4E00;&#x4E2A;&#x7D27;&#x51D1;&#x7684;&#x72EC;&#x7ACB;&#x7684;&#x6240;&#x8C13;&#x4F4D;&#x56FE;&#x6587;&#x4EF6;&#x4E2D;&#x3002; xtrabackup &#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x5C06;&#x4F7F;&#x7528;&#x8BE5;&#x6587;&#x4EF6;&#x4EC5;&#x8BFB;&#x53D6;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#x9875;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x80FD;&#x8282;&#x7701;&#x8BB8;&#x591A;&#x8BFB;&#x53D6;&#x8BF7;&#x6C42;&#x3002;&#x5982;&#x679C; xtrabackup &#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x627E;&#x5230;&#x4F4D;&#x56FE;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x542F;&#x7528;&#x540E;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#x3002;&#x5373;&#x4F7F;&#x4F4D;&#x56FE;&#x6570;&#x636E;&#x53EF;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6307;&#x5B9A; --incremental-force-scan &#x6765;&#x8BFB;&#x53D6;&#x6240;&#x6709;&#x9875;&#x9762;&#x3002;</p>
<blockquote>
<p>Important
&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x5C06;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4E0E;&#x5148;&#x524D;&#x5907;&#x4EFD;&#x7684;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x90E8;&#x5206;&#x5907;&#x4EFD;&#x540E;&#x8FD0;&#x884C;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x3002;
&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x53EA;&#x9700;&#x8BFB;&#x53D6;&#x9875;&#x9762;&#x5E76;&#x5C06;&#x5176; LSN &#x4E0E;&#x4E0A;&#x6B21;&#x5907;&#x4EFD;&#x7684; LSN &#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x6765;&#x6062;&#x590D;&#x589E;&#x91CF;&#x66F4;&#x6539;&#xFF1B;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x4F5C;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x662F;&#x6CA1;&#x6709;&#x7528;&#x7684;&#x3002;
&#x5982;&#x679C;&#x60A8;&#x77E5;&#x9053;&#x5B83;&#x7684; LSN&#xFF0C;&#x60A8;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; --incremental-lsn &#x9009;&#x9879;&#x6267;&#x884C;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x9700;&#x8981;&#x4EE5;&#x524D;&#x7684;&#x5907;&#x4EFD;&#x3002;</p>
</blockquote>
<pre><code>xtrabackup --backup --target-dir=/data/backups/base
</code></pre><p>&#x5982;&#x679C;&#x60A8;&#x67E5;&#x770B; xtrabackup_checkpoints &#x6587;&#x4EF6;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x4F1A;&#x770B;&#x5230;&#x7C7B;&#x4F3C;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E;&#x60A8;&#x7684; LSN &#x7F16;&#x53F7;&#xFF1A;</p>
<pre><code>backup_type = full-backuped
from_lsn = 0
to_lsn = 1626007
last_lsn = 1626007
compact = 0
recover_binlog_info = 1
</code></pre><p>&#x73B0;&#x5728;&#x60A8;&#x6709;&#x4E86;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x5B83;&#x8FDB;&#x884C;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x3002;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre><code>xtrabackup --backup --target-dir=/data/backups/inc1 \
--incremental-basedir=/data/backups/base
</code></pre><p>data/backups/inc1/ &#x76EE;&#x5F55;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x589E;&#x91CF;&#x6587;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982; ibdata1.delta &#x548C; test/table1.ibd.delta&#x3002;&#x8FD9;&#x4E9B;&#x4EE3;&#x8868;&#x81EA; LSN 1626007 &#x4EE5;&#x6765;&#x7684;&#x66F4;&#x6539;&#x3002; &#x5982;&#x679C;&#x60A8;&#x68C0;&#x67E5;&#x6B64;&#x76EE;&#x5F55;&#x4E2D;&#x7684; xtrabackup_checkpoints &#x6587;&#x4EF6;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x4E0E;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x7C7B;&#x4F3C;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</p>
<p>from_lsn &#x662F;&#x5907;&#x4EFD;&#x7684;&#x8D77;&#x59CB; LSN&#xFF0C;&#x5BF9;&#x4E8E;&#x589E;&#x91CF;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x4E0E;&#x524D;&#x4E00;&#x4E2A;/&#x57FA;&#x672C;&#x5907;&#x4EFD;&#x7684; to_lsn&#xFF08;&#x5982;&#x679C;&#x5B83;&#x662F;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x68C0;&#x67E5;&#x70B9;&#xFF09;&#x76F8;&#x540C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5C06;&#x6B64;&#x76EE;&#x5F55;&#x7528;&#x4F5C;&#x53E6;&#x4E00;&#x4E2A;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x7684;&#x57FA;&#x7840;&#xFF1A;</p>
<pre><code>xtrabackup --backup --target-dir=/data/backups/inc2 \
--incremental-basedir=/data/backups/inc1
</code></pre><p>&#x6B64;&#x6587;&#x4EF6;&#x5939;&#x8FD8;&#x5305;&#x542B; xtrabackup_checkpoints&#xFF1A;</p>
<pre><code>backup_type = incremental
from_lsn = 4124244
to_lsn = 6938371
last_lsn = 7110572
compact = 0
recover_binlog_info = 1
</code></pre><blockquote>
<p>Note
&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230; to_lsn&#xFF08;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x68C0;&#x67E5;&#x70B9; LSN&#xFF09;&#x548C; last_lsn&#xFF08;&#x6700;&#x540E;&#x590D;&#x5236;&#x7684; LSN&#xFF09;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x5907;&#x4EFD;&#x8FC7;&#x7A0B;&#x4E2D;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x6D41;&#x91CF;&#x3002;</p>
</blockquote>
<h2 id="&#x51C6;&#x5907;&#x589E;&#x91CF;&#x5907;&#x4EFD;">&#x51C6;&#x5907;&#x589E;&#x91CF;&#x5907;&#x4EFD;</h2>
<p>&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x7684; --prepare &#x6B65;&#x9AA4;&#x4E0E;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x4E0D;&#x540C;&#x3002;&#x5728;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x4E2D;&#xFF0C;&#x6267;&#x884C;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x64CD;&#x4F5C;&#x4EE5;&#x4F7F;&#x6570;&#x636E;&#x5E93;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF1A;&#x9488;&#x5BF9;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4ECE;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x91CD;&#x653E;&#x5DF2;&#x63D0;&#x4EA4;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x56DE;&#x6EDA;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x4E8B;&#x52A1;&#x3002;&#x5728;&#x51C6;&#x5907;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x65F6;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x8DF3;&#x8FC7;&#x672A;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x7684;&#x56DE;&#x6EDA;&#xFF0C;&#x56E0;&#x4E3A;&#x5907;&#x4EFD;&#x65F6;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x6B21;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x4E2D;&#x63D0;&#x4EA4;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; --apply-log-only &#x9009;&#x9879;&#x6765;&#x9632;&#x6B62;&#x56DE;&#x6EDA;&#x9636;&#x6BB5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x4F7F;&#x7528; --apply-log-only &#x9009;&#x9879;&#x6765;&#x963B;&#x6B62;&#x56DE;&#x6EDA;&#x9636;&#x6BB5;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x7684;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x5C06;&#x6BEB;&#x65E0;&#x7528;&#x5904;&#x3002;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;&#x540E;&#xFF0C;&#x65E0;&#x6CD5;&#x5E94;&#x7528;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x3002;</p>
<p>&#x4ECE;&#x60A8;&#x521B;&#x5EFA;&#x7684;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x5F00;&#x59CB;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x51C6;&#x5907;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5176;&#x5E94;&#x7528;&#x589E;&#x91CF;&#x5DEE;&#x5F02;&#x3002;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x60A8;&#x6709;&#x4EE5;&#x4E0B;&#x5907;&#x4EFD;&#xFF1A;</p>
<pre><code>/data/backups/base
/data/backups/inc1
/data/backups/inc2
</code></pre><p>&#x51C6;&#x5907;&#x57FA;&#x672C;&#x5907;&#x4EFD;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#x8FD0;&#x884C; --prepare&#xFF0C;&#x4F46;&#x8981;&#x9632;&#x6B62;&#x56DE;&#x6EDA;&#x9636;&#x6BB5;&#xFF1A;</p>
<pre><code>xtrabackup --prepare --apply-log-only --target-dir=/data/backups/base
</code></pre><p>&#x8F93;&#x51FA;&#x5E94;&#x4EE5;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x7684;&#x6587;&#x672C;&#x7ED3;&#x5C3E;&#xFF1A;</p>
<pre><code>InnoDB: Shutdown completed; log sequence number 1626007
161011 12:41:04 completed OK!
</code></pre><p>&#x65E5;&#x5FD7;&#x5E8F;&#x5217;&#x53F7;&#x5E94;&#x8BE5;&#x4E0E;&#x60A8;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x7684;&#x57FA;&#x672C;&#x5907;&#x4EFD;&#x7684; to_lsn &#x5339;&#x914D;&#x3002;</p>
<blockquote>
<p>Note<br>&#x5373;&#x4F7F;&#x8DF3;&#x8FC7;&#x4E86;&#x56DE;&#x6EDA;&#x9636;&#x6BB5;&#xFF0C;&#x8BE5;&#x5907;&#x4EFD;&#x73B0;&#x5728;&#x4E5F;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x6062;&#x590D;&#x539F;&#x6837;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6062;&#x590D;&#x5B83;&#x5E76;&#x542F;&#x52A8; MySQL&#xFF0C;InnoDB &#x5C06;&#x68C0;&#x6D4B;&#x5230;&#x6CA1;&#x6709;&#x6267;&#x884C;&#x56DE;&#x6EDA;&#x9636;&#x6BB5;&#xFF0C;&#x5B83;&#x4F1A;&#x5728;&#x540E;&#x53F0;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x50CF;&#x5B83;&#x901A;&#x5E38;&#x5728;&#x542F;&#x52A8;&#x65F6;&#x8FDB;&#x884C;&#x5D29;&#x6E83;&#x6062;&#x590D;&#x4E00;&#x6837;&#x3002;&#x5B83;&#x4F1A;&#x901A;&#x77E5;&#x60A8;&#x6570;&#x636E;&#x5E93;&#x6CA1;&#x6709;&#x6B63;&#x5E38;&#x5173;&#x95ED;&#x3002;</p>
</blockquote>
<p>&#x8981;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x5E94;&#x7528;&#x5230;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#xFF0C;&#x8BF7;&#x8FD0;&#x884C;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre><code class="lang-haha">xtrabackup --prepare --apply-log-only --target-dir=/data/backups/base \
--incremental-dir=/data/backups/inc1
</code></pre>
<p>&#x8FD9;&#x4F1A;&#x5C06;&#x589E;&#x91CF;&#x6587;&#x4EF6;&#x5E94;&#x7528;&#x4E8E; /data/backups/base &#x4E2D;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4F1A;&#x5C06;&#x5B83;&#x4EEC;&#x53CA;&#x65F6;&#x524D;&#x6EDA;&#x5230;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x7136;&#x540E;&#x5B83;&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#x5C06;&#x91CD;&#x505A;&#x65E5;&#x5FD7;&#x5E94;&#x7528;&#x4E8E;&#x7ED3;&#x679C;&#x3002;&#x6700;&#x7EC8;&#x6570;&#x636E;&#x5728;/data/backups/base&#xFF0C;&#x4E0D;&#x5728;&#x589E;&#x91CF;&#x76EE;&#x5F55;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x4F1A;&#x770B;&#x5230;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x7684;&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code>incremental backup from 1626007 is enabled.
xtrabackup: cd to /data/backups/base
xtrabackup: This target seems to be already prepared with --apply-log-only.
xtrabackup: xtrabackup_logfile detected: size=2097152, start_lsn=(4124244)
...
xtrabackup: page size for /tmp/backups/inc1/ibdata1.delta is 16384 bytes
Applying /tmp/backups/inc1/ibdata1.delta to ./ibdata1...
...
161011 12:45:56 completed OK!
</code></pre><p>&#x540C;&#x6837;&#xFF0C;LSN &#x5E94;&#x8BE5;&#x4E0E;&#x60A8;&#x4E4B;&#x524D;&#x68C0;&#x67E5;&#x7B2C;&#x4E00;&#x4E2A;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x65F6;&#x770B;&#x5230;&#x7684;&#x76F8;&#x7B26;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4ECE; /data/backups/base &#x6062;&#x590D;&#x6587;&#x4EF6;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<blockquote>
<p>Warning
Percona XtraBackup &#x4E0D;&#x652F;&#x6301;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x76EE;&#x5F55;&#x6765;&#x51C6;&#x5907;&#x4E24;&#x4E2A;&#x5907;&#x4EFD;&#x526F;&#x672C;&#x3002;&#x4E0D;&#x8981;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x76EE;&#x5F55;&#xFF08;-incremental-dir &#x7684;&#x503C;&#xFF09;&#x591A;&#x6B21;&#x8FD0;&#x884C; --prepare&#x3002;</p>
</blockquote>
<p>&#x51C6;&#x5907;&#x7B2C;&#x4E8C;&#x6B21;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;&#x5C06;&#x589E;&#x91CF;&#x5E94;&#x7528;&#x4E8E;&#xFF08;&#x4FEE;&#x6539;&#x540E;&#x7684;&#xFF09;&#x57FA;&#x7840;&#x5907;&#x4EFD;&#xFF0C;&#x60A8;&#x5C06;&#x53CA;&#x65F6;&#x5C06;&#x5176;&#x6570;&#x636E;&#x524D;&#x6EDA;&#x5230;&#x7B2C;&#x4E8C;&#x6B21;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x7684;&#x70B9;&#xFF1A;</p>
<pre><code>trabackup --prepare --target-dir=/data/backups/base \
--incremental-dir=/data/backups/inc2
</code></pre><blockquote>
<p>Note
--apply-log-only &#x5E94;&#x8BE5;&#x5728;&#x5408;&#x5E76;&#x9664;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4E4B;&#x5916;&#x7684;&#x6240;&#x6709;&#x589E;&#x91CF;&#x65F6;&#x4F7F;&#x7528;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x524D;&#x4E00;&#x884C;&#x4E0D;&#x5305;&#x542B; --apply-log-only &#x9009;&#x9879;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5373;&#x4F7F;&#x5728;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x4F7F;&#x7528;&#x4E86; --apply-log-only&#xFF0C;&#x5907;&#x4EFD;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x4F46;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x6267;&#x884C;&#x56DE;&#x6EDA;&#x9636;&#x6BB5;&#x3002;  </p>
</blockquote>
<p>&#x4E00;&#x65E6;&#x51C6;&#x5907;&#x597D;&#x589E;&#x91CF;&#x5907;&#x4EFD;&#x4E0E;&#x5B8C;&#x6574;&#x5907;&#x4EFD;&#x76F8;&#x540C;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6062;&#x590D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="4.1 完整备份.html" class="navigation navigation-prev " aria-label="Previous page: 4.1 完整备份.md">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="4.3 压缩备份.html" class="navigation navigation-next " aria-label="Next page: 4.3 压缩备份.md">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"4.2 增量备份.md","level":"1.13","depth":1,"next":{"title":"4.3 压缩备份.md","level":"1.14","depth":1,"path":"doc/4.3 压缩备份.md","ref":"./doc/4.3 压缩备份.md","articles":[]},"previous":{"title":"4.1 完整备份.md","level":"1.12","depth":1,"path":"doc/4.1 完整备份.md","ref":"./doc/4.1 完整备份.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"doc/4.2 增量备份.md","mtime":"2021-12-23T22:07:31.078Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-08-13T03:52:48.909Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

